app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
            <div class="col-sm-11">
              <p class="post-content"><span class="post-owner"><%= link_to(User.find_by_id(post.user_id).username.to_s, "/user/"+User.find_by_id(post.user_id).username) %></span> - <span class="post-creation"><%= post.created_at.to_formatted_s(:short) %></span></p>