app/views/pages/profile.html.erb

            <div class="col-sm-11">
              <p class="post-content"><span class="post-owner"><%= User.find_by_id(post.user_id).username %></span> - <span class="post-creation"><%= post.created_at.to_formatted_s(:short) %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."created_at" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (:user_id = 3)  ORDER BY "posts"."created_at" DESC

    <div class="col-xs-3">
      <%= render '/components/follow_button', :user => User.find_by_username(params[:id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "Bob"]]