app/controllers/pages_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def home
    @posts = []
    Post.all.each do |p|
      if current_user.following? User.find(p.user_id) or p.user_id === current_user.id
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def profile
    if(User.find_by_username(params[:id]))
      @username = params[:id]
    else
      redirect_to root_path, :notice => "User not found"
    end
    @posts = Post.all.where('user_id = ?',User.find_by_username(params[:id]).id)
    @newPost = Post.new
    @toFollow = User.all.last(5)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "loko"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."created_at" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (:user_id = 3)  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def explore
    @newPost = Post.new
    @posts = Post.all
    @toFollow = User.all.last(5)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5